app/controllers/authentications_controller.rb

  def register
    if is_student?
      user = Student.new(user_params)
    else
      user = Teacher.new(user_params)
    end

    if user.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "password_digest", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "teachers" ("name", "email", "password_digest", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def login
    if is_student?
      student = Student.find_by_email(params[:email])
      if student && student.authenticate(params[:password])
        token = Auth.issue({ id: student.id, role: 'student'})
        render json: { token: token, student: StudentSerializer.new(student) }, status: :ok
      else
        render json: { errors: ["Invalid login credentials."] }, status: 401
      end
    else
      teacher = Teacher.find_by_email(params[:email])
---
SELECT  "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "clare@email.com"], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "cmc@email.com"], ["LIMIT", 1]]