app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def index
    @challenges = Challenge.all

INSERT INTO "challenges" ("title", "question", "answer", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @challenge = Challenge.new(challenge_params)

    if @challenge.save

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:id])