app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all