app/controllers/solutions_controller.rb

SELECT "solutions".* FROM "solutions"
---
  def index
    @solutions = Solution.all

INSERT INTO "solutions" ("challenge_id", "student_id", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["challenge_id", 1], ["student_id", 1], ["answer", "6"], ["created_at", "2017-07-24 15:31:18.028657"], ["updated_at", "2017-07-24 15:31:18.028657"]]
---
  def create
    @solution = Solution.new(solution_params)

    if @solution.save