app/controllers/topics_controller.rb

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]